app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2015-01-21"], ["name", "Chris"], ["description", "fattttt"], ["updated_at", "2022-03-11 21:12:30.953346"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)